import { defineConfig } from 'vitepress'

export default defineConfig({
  base: '/system-knowledge-base/',
  title: '系统知识库',
  description: '家装管理系统业务逻辑梳理与排查知识库',
  head: [
    ['link', { rel: 'stylesheet', href: 'https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css' }],
    ['link', { rel: 'icon', href: 'data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 viewBox=%220 0 100 100%22><text y=%22.9em%22 font-size=%2290%22>📋</text></svg>'}]
  ],
  themeConfig: {
    outline: false,
    nav: [
      { text: '🏠 家装真实性核销', link: '/家装管理/项目往来/家装真实性核销/' },
      { text: '📂 家装管理', link: '/家装管理/项目往来/家装真实性核销/' },
      { text: '⚙️ 工程管理', link: '/工程管理/服务费/服务费业务背景/' },
      { text: '📋 经销合同管理', link: '/经销合同管理/销售合同/认缴申请/' },
      { text: '🎯 点将管理', link: '/点将管理/基础管理/讲师档案/' },
      { text: '📦 产品中心', link: '/产品中心/产品资料/产品列表/' },
      { text: '📝 电子合同管理', link: '/电子合同管理/基础管理/合同模板管理/' },
      { text: '🔧 开发管理', link: '/开发管理/值集配置/装修等级/' }
    ],
    sidebar: {
      '/家装管理/': [
        {
          text: '项目往来',
          items: [
            { text: '🏠 家装真实性核销', link: '/家装管理/项目往来/家装真实性核销/' }
          ]
        },
        {
          text: '家装往来',
          items: [
            { text: '🧾 家装核销发票上传', link: '/家装管理/家装往来/家装核销发票上传/' },
            { text: '🛒 家装要货订单', link: '/家装管理/家装往来/家装要货订单/' }
          ]
        },
        {
          text: '项目交付',
          items: [
            { text: '📊 家装折扣政策申请', link: '/家装管理/项目交付/家装折扣政策申请/' }
          ]
        }
      ],
      '/工程管理/': [
        {
          text: '服务费',
          items: [
            { text: '📋 服务费业务背景', link: '/工程管理/服务费/服务费业务背景/' },
            { text: '📑 工程服务费报销', link: '/工程管理/服务费/工程服务费报销/' },
            { text: '✅ 工程服务费兑现', link: '/工程管理/服务费/工程服务费兑现/' }
          ]
        },
        {
          text: '项目往来',
          items: [
            { text: '💰 工程服务费预提', link: '/工程管理/项目往来/工程服务费预提/' },
            { text: '📥 项目到款引入', link: '/工程管理/项目往来/项目到款引入/' },
            { text: '💳 项目到款认领', link: '/工程管理/项目往来/项目到款认领/' },
            { text: '↩️ 项目到款认领撤销', link: '/工程管理/项目往来/项目到款认领撤销/' },
            { text: '🏷️ 工程折扣政策', link: '/工程管理/项目往来/工程折扣政策/' },
            { text: '🧾 工程核销发票上传', link: '/工程管理/项目往来/工程核销发票上传/' },
            { text: '✅ 工程真实性核销', link: '/工程管理/项目往来/工程真实性核销/' }
          ]
        },
        {
          text: '项目交付',
          items: [
            { text: '📦 工程要货订单', link: '/工程管理/项目交付/工程要货订单/' },
            { text: '📊 工程折扣政策申请', link: '/工程管理/项目交付/工程折扣政策申请/' },
            { text: '🚫 工程折扣政策失效', link: '/工程管理/项目交付/工程折扣政策失效/' },
            { text: '📋 折扣单报表', link: '/工程管理/项目交付/折扣单报表/' },
            { text: '🔁 工程合同产品变更', link: '/工程管理/项目交付/工程合同产品变更/' },
            { text: '🗑️ 工程取消核销与发票作废', link: '/工程管理/项目交付/工程取消核销与发票作废/' },
            { text: '⏱️ 工程折扣延期', link: '/工程管理/项目交付/工程折扣延期/' },
            { text: '⚡ 紧急要货插单', link: '/工程管理/项目交付/紧急要货插单/' },
            { text: '📅 提货时间变更', link: '/工程管理/项目交付/提货时间变更/' },
            { text: '🚀 订单紧急要货', link: '/工程管理/项目交付/订单紧急要货/' },
            { text: '🔍 折扣政策明细查询（内部）', link: '/工程管理/项目交付/折扣政策明细查询（内部）/' },
            { text: '⏳ 有效延期申请', link: '/工程管理/项目交付/有效延期申请/' },
            { text: '📈 紧急要货报表', link: '/工程管理/项目交付/紧急要货报表/' },
            { text: '📦 工程要货订单报表', link: '/工程管理/项目交付/工程要货订单报表/' }
          ]
        },
        {
          text: '项目商机',
            items: [
              { text: '📄 报备生失效申请', link: '/工程管理/项目商机/报备生失效申请/' },
              { text: '❄️ 报备解冻申请', link: '/工程管理/项目商机/报备解冻申请/' },
              { text: '✅ 工程项目结案', link: '/工程管理/项目商机/工程项目结案/' },
              { text: '📦 单体项目报备', link: '/工程管理/项目商机/单体项目报备/' },
              { text: '🗂️ 工程项目档案', link: '/工程管理/项目商机/工程项目档案/' },
              { text: '👔 战略经理变更', link: '/工程管理/项目商机/战略经理变更/' },
              { text: '🛡️ 价格保护函', link: '/工程管理/项目商机/价格保护函/' },
              { text: '📈 项目进度更新', link: '/工程管理/项目商机/项目进度更新/' },
              { text: '📝 战略报备变更', link: '/工程管理/项目商机/战略报备变更/' },
              { text: '♜ 战略项目报备', link: '/工程管理/项目商机/战略项目报备/' }
            ]
          },
        {
          text: '项目合同',
          items: [
            { text: '📝 自营工程合同', link: '/工程管理/项目合同/自营工程合同/' },
            { text: '🤝 经销商工程合同', link: '/工程管理/项目合同/经销商工程合同/' }
          ]
        },
        {
          text: '合同与折扣',
          items: [
            { text: '🏷️ 工程折扣单', link: '/工程管理/合同与折扣/工程折扣单/' },
            { text: '🚫 项目合同失效', link: '/工程管理/合同与折扣/项目合同失效/' },
            { text: '✅ 工程自营签收', link: '/工程管理/合同与折扣/工程自营签收/' }
          ]
        }
      ],
      '/财务管理/': [
        {
          text: '预提与冲销',
          items: [
            { text: '↔️ 工程服务费冲销', link: '/财务管理/预提与冲销/工程服务费冲销/' },
            { text: '📊 额度内冲销报表', link: '/财务管理/预提与冲销/额度内冲销报表/' },
            { text: '📈 额度内预提报表', link: '/财务管理/预提与冲销/额度内预提报表/' }
          ]
        },
        {
          text: '调整单',
          items: [
            { text: '📣 广告费调整申请单', link: '/财务管理/调整单/广告费调整申请单/' },
            { text: '🏅 政策性补贴申请', link: '/财务管理/调整单/政策性补贴申请/' },
            { text: '✅ 销售提价兑现', link: '/财务管理/调整单/销售提价兑现/' }
          ]
        },
        {
          text: '对账单',
          items: [
            { text: '💰 经销商余额明细查询', link: '/财务管理/对账单/经销商余额明细查询/' },
            { text: '🧾 客户金税发票号码查询', link: '/财务管理/对账单/客户金税发票号码查询/' },
            { text: '📋 待兑现折扣折让对账单', link: '/财务管理/对账单/待兑现折扣折让对账单/' },
            { text: '📑 额度内市场推广服务费对账单', link: '/财务管理/对账单/额度内市场推广服务费对账单/' },
            { text: '💵 额度外预算总额', link: '/财务管理/对账单/额度外预算总额/' },
            { text: '🏢 法人对账单', link: '/财务管理/对账单/法人对账单/' },
            { text: '📢 广告费余额查询', link: '/财务管理/对账单/广告费余额查询/' },
            { text: '🏅 政策性补贴申请', link: '/财务管理/对账单/政策性补贴申请/' }
          ]
        }
      ],
      '/门店管理/': [
        {
          text: '门店设置',
          items: [
            { text: '🪧 门头展板报销标准', link: '/门店管理/门店设置/门头展板报销标准/' },
            { text: '📊 经销商额度外限额', link: '/门店管理/门店设置/经销商额度外限额/' },
            { text: '📸 门店照片设置', link: '/门店管理/门店设置/门店照片设置/' },
            { text: '🎨 门店装修标准', link: '/门店管理/门店设置/门店装修标准/' },
            { text: '✅ 门头验收信息设置', link: '/门店管理/门店设置/门头验收信息设置/' }
          ]
        },
        {
          text: '门店档案',
          items: [
            { text: '🔄 门店变更申请', link: '/门店管理/门店档案/门店变更申请/' },
            { text: '📋 门店档案', link: '/门店管理/门店档案/门店档案/' },
            { text: '🏪 新建门店申请', link: '/门店管理/门店档案/新建门店申请/' }
          ]
        },
        {
          text: '门店装修',
          items: [
            { text: '💵 门头展板兑现', link: '/门店管理/门店装修/门头展板兑现/' },
            { text: '✅ 额度内兑现批量复核', link: '/门店管理/门店装修/额度内兑现批量复核/' },
            { text: '📋 门店验收与报销单', link: '/门店管理/门店装修/门店验收与报销单/' },
            { text: '💰 门店装修额度内兑现', link: '/门店管理/门店装修/门店装修额度内兑现/' },
            { text: '💳 门店装修额度外兑现', link: '/门店管理/门店装修/门店装修额度外兑现/' },
            { text: '✏️ 门店装修申请变更', link: '/门店管理/门店装修/门店装修申请变更/' },
            { text: '🚫 门店装修申请关闭', link: '/门店管理/门店装修/门店装修申请关闭/' },
            { text: '📝 门店装修申请与进度更新', link: '/门店管理/门店装修/门店装修申请与进度更新/' },
            { text: '📄 门头展板报销申请单', link: '/门店管理/门店装修/门头展板报销申请单/' }
          ]
        },
        {
          text: '样品及长库龄管理',
          items: [
            { text: '🏷️ 样品及长库龄折扣政策', link: '/门店管理/样品及长库龄管理/样品及长库龄折扣政策/' },
            { text: '🚫 样品及长库龄折扣政策失效', link: '/门店管理/样品及长库龄管理/样品及长库龄折扣政策失效/' },
            { text: '📦 样品及长库龄要货订单', link: '/门店管理/样品及长库龄管理/样品及长库龄要货订单/' }
          ]
        },
        {
          text: '门店报表',
          items: [
            { text: '📊 门店统计分析', link: '/门店管理/门店报表/门店统计分析/' },
            { text: '📋 出库单计算广告费明细报表', link: '/门店管理/门店报表/出库单计算广告费明细报表/' },
            { text: '💰 店面额度内兑现余额表', link: '/门店管理/门店报表/店面额度内兑现余额表/' },
            { text: '📑 额度外占用预算明细', link: '/门店管理/门店报表/额度外占用预算明细/' },
            { text: '🗺️ 户外广告分布', link: '/门店管理/门店报表/户外广告分布/' },
            { text: '📍 门店区域分布', link: '/门店管理/门店报表/门店区域分布/' }
          ]
        },
        {
          text: '广告投放',
          items: [
            { text: '🧾 广告报销发票兑现', link: '/门店管理/广告投放/广告报销发票兑现/' },
            { text: '📄 广告费报销', link: '/门店管理/广告投放/广告费报销/' },
            { text: '📝 广告投放申请', link: '/门店管理/广告投放/广告投放申请/' }
          ]
        },
        {
          text: '装修报表',
          items: [
            { text: '📊 门额度内兑现统计报表', link: '/门店管理/装修报表/门额度内兑现统计报表/' },
            { text: '📋 兑现汇总', link: '/门店管理/装修报表/兑现汇总/' },
            { text: '📑 门店验收与报销单报表', link: '/门店管理/装修报表/门店验收与报销单报表/' },
            { text: '💰 门店装修额度外报表', link: '/门店管理/装修报表/门店装修额度外报表/' },
            { text: '📝 门店装修申请与进度更新报表', link: '/门店管理/装修报表/门店装修申请与进度更新报表/' }
          ]
        }
      ],
      '/经销合同管理/': [
        {
          text: '销售合同',
          items: [
            { text: '📝 认缴申请', link: '/经销合同管理/销售合同/认缴申请/' },
            { text: '💰 保证金减免申请', link: '/经销合同管理/销售合同/保证金减免申请/' },
            { text: '🔒 合同保证金', link: '/经销合同管理/销售合同/合同保证金/' },
            { text: '🔄 经销合同变更', link: '/经销合同管理/销售合同/经销合同变更/' },
            { text: '📄 年度经销合同', link: '/经销合同管理/销售合同/年度经销合同/' },
            { text: '📊 认缴概况', link: '/经销合同管理/销售合同/认缴概况/' }
          ]
        },
        {
          text: '合同管理',
          items: [
            { text: '✅ 合同任务完成率', link: '/经销合同管理/合同管理/合同任务完成率/' },
            { text: '📋 合同任务完成率明细报表', link: '/经销合同管理/合同管理/合同任务完成率明细报表/' },
            { text: '📁 经销合同归档', link: '/经销合同管理/合同管理/经销合同归档/' },
            { text: '📐 年度营销政策', link: '/经销合同管理/合同管理/年度营销政策/' }
          ]
        },
        {
          text: '报表中心',
          items: [
            { text: '🗺️ 经销合同销售区域报表', link: '/经销合同管理/报表中心/经销合同销售区域报表/' }
          ]
        }
      ],
      '/点将管理/': [
        {
          text: '特训营管理',
          items: [
            { text: '🏕️ 特训营管理', link: '/点将管理/特训营管理/特训营管理/' },
            { text: '📝 特训营点将管理', link: '/点将管理/特训营管理/特训营点将管理/' },
            { text: '▶️ 特训营点将执行', link: '/点将管理/特训营管理/特训营点将执行/' },
            { text: '🏃 活动点将执行', link: '/点将管理/特训营管理/活动点将执行/' }
          ]
        },
        {
          text: '策划师点将',
          items: [
            { text: '📋 活动点将管理', link: '/点将管理/策划师点将/活动点将管理/' }
          ]
        },
        {
          text: '单店培训点将管理',
          items: [
            { text: '📝 单店点将管理', link: '/点将管理/单店培训点将管理/单店点将管理/' },
            { text: '▶️ 单店点将执行', link: '/点将管理/单店培训点将管理/单店点将执行/' }
          ]
        },
        {
          text: '基础管理',
          items: [
            { text: '👤 讲师档案', link: '/点将管理/基础管理/讲师档案/' },
            { text: '✅ 档案审批', link: '/点将管理/基础管理/档案审批/' },
            { text: '📅 讲师排期', link: '/点将管理/基础管理/讲师排期/' }
          ]
        },
        {
          text: '经销商点将',
          items: [
            { text: '🏪 单店点将', link: '/点将管理/经销商点将/单店点将/' },
            { text: '🎉 活动点将', link: '/点将管理/经销商点将/活动点将/' },
            { text: '🎨 设计点将', link: '/点将管理/经销商点将/设计点将/' },
            { text: '🏕️ 特训营', link: '/点将管理/经销商点将/特训营/' }
          ]
        },
        {
          text: '设计师点将',
          items: [
            { text: '📊 设计师饱和度', link: '/点将管理/设计师点将/设计师饱和度/' },
            { text: '📝 设计师点将管理', link: '/点将管理/设计师点将/设计师点将管理/' },
            { text: '▶️ 设计师点将执行', link: '/点将管理/设计师点将/设计师点将执行/' }
          ]
        }
      ],
      '/产品中心/': [
        {
          text: '产品资料',
          items: [
            { text: '📋 产品列表', link: '/产品中心/产品资料/产品列表/' },
            { text: '📂 产品分类', link: '/产品中心/产品资料/产品分类/' },
            { text: '🔄 产品变更列表', link: '/产品中心/产品资料/产品变更列表/' },
            { text: '📝 产品SM状态变更申请', link: '/产品中心/产品资料/产品SM状态变更申请/' },
            { text: '🖼️ 产品图册', link: '/产品中心/产品资料/产品图册/' },
            { text: '📷 产品图片上传', link: '/产品中心/产品资料/产品图片上传/' },
            { text: '⭐ 产品推广等级维护', link: '/产品中心/产品资料/产品推广等级维护/' },
            { text: '⚙️ 产品推广等级要求配置', link: '/产品中心/产品资料/产品推广等级要求配置/' }
          ]
        },
        {
          text: '价目表',
          items: [
            { text: '💰 价目表查询', link: '/产品中心/价目表/价目表查询/' },
            { text: '🔀 跨事业部产品产品销售申请', link: '/产品中心/价目表/跨事业部产品产品销售申请/' },
            { text: '📊 跨事业部产品销售清单', link: '/产品中心/价目表/跨事业部产品销售清单/' },
            { text: '🧱 责任制内结价定价瓷砖参数配置', link: '/产品中心/价目表/责任制内结价定价瓷砖参数配置/' },
            { text: '🔧 责任制内结价定价基础参数配置', link: '/产品中心/价目表/责任制内结价定价基础参数配置/' }
          ]
        },
        {
          text: '库存',
          items: [
            { text: '📦 库存查询', link: '/产品中心/库存/库存查询/' },
            { text: '🏢 事业部库存查询', link: '/产品中心/库存/事业部库存查询/' }
          ]
        },
        {
          text: '说明书',
          items: [
            { text: '📖 产品说明书', link: '/产品中心/说明书/产品说明书/' },
            { text: '📈 说明书查阅数据', link: '/产品中心/说明书/说明书查阅数据/' }
          ]
        }
      ],
      '/电子合同管理/': [
        {
          text: '基础管理',
          items: [
            { text: '📄 合同模板管理', link: '/电子合同管理/基础管理/合同模板管理/' }
          ]
        },
        {
          text: '经销商',
          items: [
            { text: '📋 合同管理', link: '/电子合同管理/经销商/合同管理/' }
          ]
        },
        {
          text: '品牌方',
          items: [
            { text: '⚠️ 合同签署异常处理', link: '/电子合同管理/品牌方/合同签署异常处理/' }
          ]
        }
      ],
      '/问题反馈/': [
        {
          text: '问题反馈',
          items: [
            { text: '💬 问题反馈', link: '/问题反馈/问题反馈/' },
            { text: '↩️ 问题回复', link: '/问题反馈/问题回复/' }
          ]
        }
      ],
      '/开发管理/': [
        {
          text: '值集配置',
          items: [
            { text: '🏠 装修等级', link: '/开发管理/值集配置/装修等级/' }
          ]
        }
      ]
    },
    search: { provider: 'local' },
    socialLinks: []
  },
  vite: {
    server: {
      port: 5174,
      host: '0.0.0.0'
    }
  }
})
